jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/tram.h
#define TRAM_RAM489_REG_OFST           _UINT32_(0x17A4)    /* (TRAM_RAM489) TrustRAM Offset */
#define TRAM_RAM490_REG_OFST           _UINT32_(0x17A8)    /* (TRAM_RAM490) TrustRAM Offset */
#define TRAM_RAM491_REG_OFST           _UINT32_(0x17AC)    /* (TRAM_RAM491) TrustRAM Offset */
#define TRAM_RAM492_REG_OFST           _UINT32_(0x17B0)    /* (TRAM_RAM492) TrustRAM Offset */
#define TRAM_RAM493_REG_OFST           _UINT32_(0x17B4)    /* (TRAM_RAM493) TrustRAM Offset */
#define TRAM_RAM494_REG_OFST           _UINT32_(0x17B8)    /* (TRAM_RAM494) TrustRAM Offset */
#define TRAM_RAM495_REG_OFST           _UINT32_(0x17BC)    /* (TRAM_RAM495) TrustRAM Offset */
#define TRAM_RAM496_REG_OFST           _UINT32_(0x17C0)    /* (TRAM_RAM496) TrustRAM Offset */
#define TRAM_RAM497_REG_OFST           _UINT32_(0x17C4)    /* (TRAM_RAM497) TrustRAM Offset */
#define TRAM_RAM498_REG_OFST           _UINT32_(0x17C8)    /* (TRAM_RAM498) TrustRAM Offset */
#define TRAM_RAM499_REG_OFST           _UINT32_(0x17CC)    /* (TRAM_RAM499) TrustRAM Offset */
#define TRAM_RAM500_REG_OFST           _UINT32_(0x17D0)    /* (TRAM_RAM500) TrustRAM Offset */
#define TRAM_RAM501_REG_OFST           _UINT32_(0x17D4)    /* (TRAM_RAM501) TrustRAM Offset */
#define TRAM_RAM502_REG_OFST           _UINT32_(0x17D8)    /* (TRAM_RAM502) TrustRAM Offset */
#define TRAM_RAM503_REG_OFST           _UINT32_(0x17DC)    /* (TRAM_RAM503) TrustRAM Offset */
#define TRAM_RAM504_REG_OFST           _UINT32_(0x17E0)    /* (TRAM_RAM504) TrustRAM Offset */
#define TRAM_RAM505_REG_OFST           _UINT32_(0x17E4)    /* (TRAM_RAM505) TrustRAM Offset */
#define TRAM_RAM506_REG_OFST           _UINT32_(0x17E8)    /* (TRAM_RAM506) TrustRAM Offset */
#define TRAM_RAM507_REG_OFST           _UINT32_(0x17EC)    /* (TRAM_RAM507) TrustRAM Offset */
#define TRAM_RAM508_REG_OFST           _UINT32_(0x17F0)    /* (TRAM_RAM508) TrustRAM Offset */
#define TRAM_RAM509_REG_OFST           _UINT32_(0x17F4)    /* (TRAM_RAM509) TrustRAM Offset */
#define TRAM_RAM510_REG_OFST           _UINT32_(0x17F8)    /* (TRAM_RAM510) TrustRAM Offset */
#define TRAM_RAM511_REG_OFST           _UINT32_(0x17FC)    /* (TRAM_RAM511) TrustRAM Offset */
#define TRAM_RAM512_REG_OFST           _UINT32_(0x1800)    /* (TRAM_RAM512) TrustRAM Offset */
#define TRAM_RAM513_REG_OFST           _UINT32_(0x1804)    /* (TRAM_RAM513) TrustRAM Offset */
#define TRAM_RAM514_REG_OFST           _UINT32_(0x1808)    /* (TRAM_RAM514) TrustRAM Offset */
#define TRAM_RAM515_REG_OFST           _UINT32_(0x180C)    /* (TRAM_RAM515) TrustRAM Offset */
#define TRAM_RAM516_REG_OFST           _UINT32_(0x1810)    /* (TRAM_RAM516) TrustRAM Offset */
#define TRAM_RAM517_REG_OFST           _UINT32_(0x1814)    /* (TRAM_RAM517) TrustRAM Offset */
#define TRAM_RAM518_REG_OFST           _UINT32_(0x1818)    /* (TRAM_RAM518) TrustRAM Offset */
#define TRAM_RAM519_REG_OFST           _UINT32_(0x181C)    /* (TRAM_RAM519) TrustRAM Offset */
#define TRAM_RAM520_REG_OFST           _UINT32_(0x1820)    /* (TRAM_RAM520) TrustRAM Offset */
#define TRAM_RAM521_REG_OFST           _UINT32_(0x1824)    /* (TRAM_RAM521) TrustRAM Offset */
#define TRAM_RAM522_REG_OFST           _UINT32_(0x1828)    /* (TRAM_RAM522) TrustRAM Offset */
#define TRAM_RAM523_REG_OFST           _UINT32_(0x182C)    /* (TRAM_RAM523) TrustRAM Offset */
#define TRAM_RAM524_REG_OFST           _UINT32_(0x1830)    /* (TRAM_RAM524) TrustRAM Offset */
#define TRAM_RAM525_REG_OFST           _UINT32_(0x1834)    /* (TRAM_RAM525) TrustRAM Offset */
#define TRAM_RAM526_REG_OFST           _UINT32_(0x1838)    /* (TRAM_RAM526) TrustRAM Offset */
#define TRAM_RAM527_REG_OFST           _UINT32_(0x183C)    /* (TRAM_RAM527) TrustRAM Offset */
#define TRAM_RAM528_REG_OFST           _UINT32_(0x1840)    /* (TRAM_RAM528) TrustRAM Offset */
#define TRAM_RAM529_REG_OFST           _UINT32_(0x1844)    /* (TRAM_RAM529) TrustRAM Offset */
#define TRAM_RAM530_REG_OFST           _UINT32_(0x1848)    /* (TRAM_RAM530) TrustRAM Offset */
#define TRAM_RAM531_REG_OFST           _UINT32_(0x184C)    /* (TRAM_RAM531) TrustRAM Offset */
#define TRAM_RAM532_REG_OFST           _UINT32_(0x1850)    /* (TRAM_RAM532) TrustRAM Offset */
#define TRAM_RAM533_REG_OFST           _UINT32_(0x1854)    /* (TRAM_RAM533) TrustRAM Offset */
#define TRAM_RAM534_REG_OFST           _UINT32_(0x1858)    /* (TRAM_RAM534) TrustRAM Offset */
#define TRAM_RAM535_REG_OFST           _UINT32_(0x185C)    /* (TRAM_RAM535) TrustRAM Offset */
#define TRAM_RAM536_REG_OFST           _UINT32_(0x1860)    /* (TRAM_RAM536) TrustRAM Offset */
#define TRAM_RAM537_REG_OFST           _UINT32_(0x1864)    /* (TRAM_RAM537) TrustRAM Offset */
#define TRAM_RAM538_REG_OFST           _UINT32_(0x1868)    /* (TRAM_RAM538) TrustRAM Offset */
#define TRAM_RAM539_REG_OFST           _UINT32_(0x186C)    /* (TRAM_RAM539) TrustRAM Offset */
#define TRAM_RAM540_REG_OFST           _UINT32_(0x1870)    /* (TRAM_RAM540) TrustRAM Offset */
#define TRAM_RAM541_REG_OFST           _UINT32_(0x1874)    /* (TRAM_RAM541) TrustRAM Offset */
#define TRAM_RAM542_REG_OFST           _UINT32_(0x1878)    /* (TRAM_RAM542) TrustRAM Offset */
#define TRAM_RAM543_REG_OFST           _UINT32_(0x187C)    /* (TRAM_RAM543) TrustRAM Offset */
#define TRAM_RAM544_REG_OFST           _UINT32_(0x1880)    /* (TRAM_RAM544) TrustRAM Offset */
#define TRAM_RAM545_REG_OFST           _UINT32_(0x1884)    /* (TRAM_RAM545) TrustRAM Offset */
#define TRAM_RAM546_REG_OFST           _UINT32_(0x1888)    /* (TRAM_RAM546) TrustRAM Offset */
#define TRAM_RAM547_REG_OFST           _UINT32_(0x188C)    /* (TRAM_RAM547) TrustRAM Offset */
#define TRAM_RAM548_REG_OFST           _UINT32_(0x1890)    /* (TRAM_RAM548) TrustRAM Offset */
#define TRAM_RAM549_REG_OFST           _UINT32_(0x1894)    /* (TRAM_RAM549) TrustRAM Offset */
#define TRAM_RAM550_REG_OFST           _UINT32_(0x1898)    /* (TRAM_RAM550) TrustRAM Offset */
#define TRAM_RAM551_REG_OFST           _UINT32_(0x189C)    /* (TRAM_RAM551) TrustRAM Offset */
#define TRAM_RAM552_REG_OFST           _UINT32_(0x18A0)    /* (TRAM_RAM552) TrustRAM Offset */
#define TRAM_RAM553_REG_OFST           _UINT32_(0x18A4)    /* (TRAM_RAM553) TrustRAM Offset */
#define TRAM_RAM554_REG_OFST           _UINT32_(0x18A8)    /* (TRAM_RAM554) TrustRAM Offset */
#define TRAM_RAM555_REG_OFST           _UINT32_(0x18AC)    /* (TRAM_RAM555) TrustRAM Offset */
#define TRAM_RAM556_REG_OFST           _UINT32_(0x18B0)    /* (TRAM_RAM556) TrustRAM Offset */
#define TRAM_RAM557_REG_OFST           _UINT32_(0x18B4)    /* (TRAM_RAM557) TrustRAM Offset */
#define TRAM_RAM558_REG_OFST           _UINT32_(0x18B8)    /* (TRAM_RAM558) TrustRAM Offset */
#define TRAM_RAM559_REG_OFST           _UINT32_(0x18BC)    /* (TRAM_RAM559) TrustRAM Offset */
#define TRAM_RAM560_REG_OFST           _UINT32_(0x18C0)    /* (TRAM_RAM560) TrustRAM Offset */
#define TRAM_RAM561_REG_OFST           _UINT32_(0x18C4)    /* (TRAM_RAM561) TrustRAM Offset */
#define TRAM_RAM562_REG_OFST           _UINT32_(0x18C8)    /* (TRAM_RAM562) TrustRAM Offset */
#define TRAM_RAM563_REG_OFST           _UINT32_(0x18CC)    /* (TRAM_RAM563) TrustRAM Offset */
#define TRAM_RAM564_REG_OFST           _UINT32_(0x18D0)    /* (TRAM_RAM564) TrustRAM Offset */
#define TRAM_RAM565_REG_OFST           _UINT32_(0x18D4)    /* (TRAM_RAM565) TrustRAM Offset */
#define TRAM_RAM566_REG_OFST           _UINT32_(0x18D8)    /* (TRAM_RAM566) TrustRAM Offset */
#define TRAM_RAM567_REG_OFST           _UINT32_(0x18DC)    /* (TRAM_RAM567) TrustRAM Offset */
#define TRAM_RAM568_REG_OFST           _UINT32_(0x18E0)    /* (TRAM_RAM568) TrustRAM Offset */
#define TRAM_RAM569_REG_OFST           _UINT32_(0x18E4)    /* (TRAM_RAM569) TrustRAM Offset */
#define TRAM_RAM570_REG_OFST           _UINT32_(0x18E8)    /* (TRAM_RAM570) TrustRAM Offset */
#define TRAM_RAM571_REG_OFST           _UINT32_(0x18EC)    /* (TRAM_RAM571) TrustRAM Offset */
#define TRAM_RAM572_REG_OFST           _UINT32_(0x18F0)    /* (TRAM_RAM572) TrustRAM Offset */
#define TRAM_RAM573_REG_OFST           _UINT32_(0x18F4)    /* (TRAM_RAM573) TrustRAM Offset */
#define TRAM_RAM574_REG_OFST           _UINT32_(0x18F8)    /* (TRAM_RAM574) TrustRAM Offset */
#define TRAM_RAM575_REG_OFST           _UINT32_(0x18FC)    /* (TRAM_RAM575) TrustRAM Offset */
#define TRAM_RAM576_REG_OFST           _UINT32_(0x1900)    /* (TRAM_RAM576) TrustRAM Offset */
#define TRAM_RAM577_REG_OFST           _UINT32_(0x1904)    /* (TRAM_RAM577) TrustRAM Offset */
#define TRAM_RAM578_REG_OFST           _UINT32_(0x1908)    /* (TRAM_RAM578) TrustRAM Offset */
#define TRAM_RAM579_REG_OFST           _UINT32_(0x190C)    /* (TRAM_RAM579) TrustRAM Offset */
#define TRAM_RAM580_REG_OFST           _UINT32_(0x1910)    /* (TRAM_RAM580) TrustRAM Offset */
#define TRAM_RAM581_REG_OFST           _UINT32_(0x1914)    /* (TRAM_RAM581) TrustRAM Offset */
#define TRAM_RAM582_REG_OFST           _UINT32_(0x1918)    /* (TRAM_RAM582) TrustRAM Offset */
#define TRAM_RAM583_REG_OFST           _UINT32_(0x191C)    /* (TRAM_RAM583) TrustRAM Offset */
#define TRAM_RAM584_REG_OFST           _UINT32_(0x1920)    /* (TRAM_RAM584) TrustRAM Offset */
#define TRAM_RAM585_REG_OFST           _UINT32_(0x1924)    /* (TRAM_RAM585) TrustRAM Offset */
#define TRAM_RAM586_REG_OFST           _UINT32_(0x1928)    /* (TRAM_RAM586) TrustRAM Offset */
#define TRAM_RAM587_REG_OFST           _UINT32_(0x192C)    /* (TRAM_RAM587) TrustRAM Offset */
#define TRAM_RAM588_REG_OFST           _UINT32_(0x1930)    /* (TRAM_RAM588) TrustRAM Offset */
#define TRAM_RAM589_REG_OFST           _UINT32_(0x1934)    /* (TRAM_RAM589) TrustRAM Offset */
#define TRAM_RAM590_REG_OFST           _UINT32_(0x1938)    /* (TRAM_RAM590) TrustRAM Offset */
#define TRAM_RAM591_REG_OFST           _UINT32_(0x193C)    /* (TRAM_RAM591) TrustRAM Offset */
#define TRAM_RAM592_REG_OFST           _UINT32_(0x1940)    /* (TRAM_RAM592) TrustRAM Offset */
#define TRAM_RAM593_REG_OFST           _UINT32_(0x1944)    /* (TRAM_RAM593) TrustRAM Offset */
#define TRAM_RAM594_REG_OFST           _UINT32_(0x1948)    /* (TRAM_RAM594) TrustRAM Offset */
#define TRAM_RAM595_REG_OFST           _UINT32_(0x194C)    /* (TRAM_RAM595) TrustRAM Offset */
#define TRAM_RAM596_REG_OFST           _UINT32_(0x1950)    /* (TRAM_RAM596) TrustRAM Offset */
#define TRAM_RAM597_REG_OFST           _UINT32_(0x1954)    /* (TRAM_RAM597) TrustRAM Offset */
#define TRAM_RAM598_REG_OFST           _UINT32_(0x1958)    /* (TRAM_RAM598) TrustRAM Offset */
#define TRAM_RAM599_REG_OFST           _UINT32_(0x195C)    /* (TRAM_RAM599) TrustRAM Offset */
#define TRAM_RAM600_REG_OFST           _UINT32_(0x1960)    /* (TRAM_RAM600) TrustRAM Offset */
#define TRAM_RAM601_REG_OFST           _UINT32_(0x1964)    /* (TRAM_RAM601) TrustRAM Offset */
#define TRAM_RAM602_REG_OFST           _UINT32_(0x1968)    /* (TRAM_RAM602) TrustRAM Offset */
#define TRAM_RAM603_REG_OFST           _UINT32_(0x196C)    /* (TRAM_RAM603) TrustRAM Offset */
#define TRAM_RAM604_REG_OFST           _UINT32_(0x1970)    /* (TRAM_RAM604) TrustRAM Offset */
#define TRAM_RAM605_REG_OFST           _UINT32_(0x1974)    /* (TRAM_RAM605) TrustRAM Offset */
#define TRAM_RAM606_REG_OFST           _UINT32_(0x1978)    /* (TRAM_RAM606) TrustRAM Offset */
#define TRAM_RAM607_REG_OFST           _UINT32_(0x197C)    /* (TRAM_RAM607) TrustRAM Offset */
#define TRAM_RAM608_REG_OFST           _UINT32_(0x1980)    /* (TRAM_RAM608) TrustRAM Offset */
#define TRAM_RAM609_REG_OFST           _UINT32_(0x1984)    /* (TRAM_RAM609) TrustRAM Offset */
#define TRAM_RAM610_REG_OFST           _UINT32_(0x1988)    /* (TRAM_RAM610) TrustRAM Offset */
#define TRAM_RAM611_REG_OFST           _UINT32_(0x198C)    /* (TRAM_RAM611) TrustRAM Offset */
#define TRAM_RAM612_REG_OFST           _UINT32_(0x1990)    /* (TRAM_RAM612) TrustRAM Offset */
#define TRAM_RAM613_REG_OFST           _UINT32_(0x1994)    /* (TRAM_RAM613) TrustRAM Offset */
#define TRAM_RAM614_REG_OFST           _UINT32_(0x1998)    /* (TRAM_RAM614) TrustRAM Offset */
#define TRAM_RAM615_REG_OFST           _UINT32_(0x199C)    /* (TRAM_RAM615) TrustRAM Offset */
#define TRAM_RAM616_REG_OFST           _UINT32_(0x19A0)    /* (TRAM_RAM616) TrustRAM Offset */
#define TRAM_RAM617_REG_OFST           _UINT32_(0x19A4)    /* (TRAM_RAM617) TrustRAM Offset */
#define TRAM_RAM618_REG_OFST           _UINT32_(0x19A8)    /* (TRAM_RAM618) TrustRAM Offset */
#define TRAM_RAM619_REG_OFST           _UINT32_(0x19AC)    /* (TRAM_RAM619) TrustRAM Offset */
#define TRAM_RAM620_REG_OFST           _UINT32_(0x19B0)    /* (TRAM_RAM620) TrustRAM Offset */
#define TRAM_RAM621_REG_OFST           _UINT32_(0x19B4)    /* (TRAM_RAM621) TrustRAM Offset */
#define TRAM_RAM622_REG_OFST           _UINT32_(0x19B8)    /* (TRAM_RAM622) TrustRAM Offset */
#define TRAM_RAM623_REG_OFST           _UINT32_(0x19BC)    /* (TRAM_RAM623) TrustRAM Offset */
#define TRAM_RAM624_REG_OFST           _UINT32_(0x19C0)    /* (TRAM_RAM624) TrustRAM Offset */
#define TRAM_RAM625_REG_OFST           _UINT32_(0x19C4)    /* (TRAM_RAM625) TrustRAM Offset */
#define TRAM_RAM626_REG_OFST           _UINT32_(0x19C8)    /* (TRAM_RAM626) TrustRAM Offset */
#define TRAM_RAM627_REG_OFST           _UINT32_(0x19CC)    /* (TRAM_RAM627) TrustRAM Offset */
#define TRAM_RAM628_REG_OFST           _UINT32_(0x19D0)    /* (TRAM_RAM628) TrustRAM Offset */
#define TRAM_RAM629_REG_OFST           _UINT32_(0x19D4)    /* (TRAM_RAM629) TrustRAM Offset */
#define TRAM_RAM630_REG_OFST           _UINT32_(0x19D8)    /* (TRAM_RAM630) TrustRAM Offset */
#define TRAM_RAM631_REG_OFST           _UINT32_(0x19DC)    /* (TRAM_RAM631) TrustRAM Offset */
#define TRAM_RAM632_REG_OFST           _UINT32_(0x19E0)    /* (TRAM_RAM632) TrustRAM Offset */
#define TRAM_RAM633_REG_OFST           _UINT32_(0x19E4)    /* (TRAM_RAM633) TrustRAM Offset */
#define TRAM_RAM634_REG_OFST           _UINT32_(0x19E8)    /* (TRAM_RAM634) TrustRAM Offset */
#define TRAM_RAM635_REG_OFST           _UINT32_(0x19EC)    /* (TRAM_RAM635) TrustRAM Offset */
#define TRAM_RAM636_REG_OFST           _UINT32_(0x19F0)    /* (TRAM_RAM636) TrustRAM Offset */
#define TRAM_RAM637_REG_OFST           _UINT32_(0x19F4)    /* (TRAM_RAM637) TrustRAM Offset */
#define TRAM_RAM638_REG_OFST           _UINT32_(0x19F8)    /* (TRAM_RAM638) TrustRAM Offset */
#define TRAM_RAM639_REG_OFST           _UINT32_(0x19FC)    /* (TRAM_RAM639) TrustRAM Offset */
#define TRAM_RAM640_REG_OFST           _UINT32_(0x1A00)    /* (TRAM_RAM640) TrustRAM Offset */
#define TRAM_RAM641_REG_OFST           _UINT32_(0x1A04)    /* (TRAM_RAM641) TrustRAM Offset */
#define TRAM_RAM642_REG_OFST           _UINT32_(0x1A08)    /* (TRAM_RAM642) TrustRAM Offset */
#define TRAM_RAM643_REG_OFST           _UINT32_(0x1A0C)    /* (TRAM_RAM643) TrustRAM Offset */
#define TRAM_RAM644_REG_OFST           _UINT32_(0x1A10)    /* (TRAM_RAM644) TrustRAM Offset */
#define TRAM_RAM645_REG_OFST           _UINT32_(0x1A14)    /* (TRAM_RAM645) TrustRAM Offset */
#define TRAM_RAM646_REG_OFST           _UINT32_(0x1A18)    /* (TRAM_RAM646) TrustRAM Offset */
#define TRAM_RAM647_REG_OFST           _UINT32_(0x1A1C)    /* (TRAM_RAM647) TrustRAM Offset */
#define TRAM_RAM648_REG_OFST           _UINT32_(0x1A20)    /* (TRAM_RAM648) TrustRAM Offset */
#define TRAM_RAM649_REG_OFST           _UINT32_(0x1A24)    /* (TRAM_RAM649) TrustRAM Offset */
#define TRAM_RAM650_REG_OFST           _UINT32_(0x1A28)    /* (TRAM_RAM650) TrustRAM Offset */
#define TRAM_RAM651_REG_OFST           _UINT32_(0x1A2C)    /* (TRAM_RAM651) TrustRAM Offset */
#define TRAM_RAM652_REG_OFST           _UINT32_(0x1A30)    /* (TRAM_RAM652) TrustRAM Offset */
#define TRAM_RAM653_REG_OFST           _UINT32_(0x1A34)    /* (TRAM_RAM653) TrustRAM Offset */
#define TRAM_RAM654_REG_OFST           _UINT32_(0x1A38)    /* (TRAM_RAM654) TrustRAM Offset */
#define TRAM_RAM655_REG_OFST           _UINT32_(0x1A3C)    /* (TRAM_RAM655) TrustRAM Offset */
#define TRAM_RAM656_REG_OFST           _UINT32_(0x1A40)    /* (TRAM_RAM656) TrustRAM Offset */
#define TRAM_RAM657_REG_OFST           _UINT32_(0x1A44)    /* (TRAM_RAM657) TrustRAM Offset */
#define TRAM_RAM658_REG_OFST           _UINT32_(0x1A48)    /* (TRAM_RAM658) TrustRAM Offset */
#define TRAM_RAM659_REG_OFST           _UINT32_(0x1A4C)    /* (TRAM_RAM659) TrustRAM Offset */
#define TRAM_RAM660_REG_OFST           _UINT32_(0x1A50)    /* (TRAM_RAM660) TrustRAM Offset */
#define TRAM_RAM661_REG_OFST           _UINT32_(0x1A54)    /* (TRAM_RAM661) TrustRAM Offset */
#define TRAM_RAM662_REG_OFST           _UINT32_(0x1A58)    /* (TRAM_RAM662) TrustRAM Offset */
#define TRAM_RAM663_REG_OFST           _UINT32_(0x1A5C)    /* (TRAM_RAM663) TrustRAM Offset */
#define TRAM_RAM664_REG_OFST           _UINT32_(0x1A60)    /* (TRAM_RAM664) TrustRAM Offset */
#define TRAM_RAM665_REG_OFST           _UINT32_(0x1A64)    /* (TRAM_RAM665) TrustRAM Offset */
#define TRAM_RAM666_REG_OFST           _UINT32_(0x1A68)    /* (TRAM_RAM666) TrustRAM Offset */
#define TRAM_RAM667_REG_OFST           _UINT32_(0x1A6C)    /* (TRAM_RAM667) TrustRAM Offset */
#define TRAM_RAM668_REG_OFST           _UINT32_(0x1A70)    /* (TRAM_RAM668) TrustRAM Offset */
#define TRAM_RAM669_REG_OFST           _UINT32_(0x1A74)    /* (TRAM_RAM669) TrustRAM Offset */
#define TRAM_RAM670_REG_OFST           _UINT32_(0x1A78)    /* (TRAM_RAM670) TrustRAM Offset */
#define TRAM_RAM671_REG_OFST           _UINT32_(0x1A7C)    /* (TRAM_RAM671) TrustRAM Offset */
#define TRAM_RAM672_REG_OFST           _UINT32_(0x1A80)    /* (TRAM_RAM672) TrustRAM Offset */
#define TRAM_RAM673_REG_OFST           _UINT32_(0x1A84)    /* (TRAM_RAM673) TrustRAM Offset */
#define TRAM_RAM674_REG_OFST           _UINT32_(0x1A88)    /* (TRAM_RAM674) TrustRAM Offset */
#define TRAM_RAM675_REG_OFST           _UINT32_(0x1A8C)    /* (TRAM_RAM675) TrustRAM Offset */
#define TRAM_RAM676_REG_OFST           _UINT32_(0x1A90)    /* (TRAM_RAM676) TrustRAM Offset */
#define TRAM_RAM677_REG_OFST           _UINT32_(0x1A94)    /* (TRAM_RAM677) TrustRAM Offset */
#define TRAM_RAM678_REG_OFST           _UINT32_(0x1A98)    /* (TRAM_RAM678) TrustRAM Offset */
#define TRAM_RAM679_REG_OFST           _UINT32_(0x1A9C)    /* (TRAM_RAM679) TrustRAM Offset */
#define TRAM_RAM680_REG_OFST           _UINT32_(0x1AA0)    /* (TRAM_RAM680) TrustRAM Offset */
#define TRAM_RAM681_REG_OFST           _UINT32_(0x1AA4)    /* (TRAM_RAM681) TrustRAM Offset */
#define TRAM_RAM682_REG_OFST           _UINT32_(0x1AA8)    /* (TRAM_RAM682) TrustRAM Offset */
#define TRAM_RAM683_REG_OFST           _UINT32_(0x1AAC)    /* (TRAM_RAM683) TrustRAM Offset */
#define TRAM_RAM684_REG_OFST           _UINT32_(0x1AB0)    /* (TRAM_RAM684) TrustRAM Offset */
#define TRAM_RAM685_REG_OFST           _UINT32_(0x1AB4)    /* (TRAM_RAM685) TrustRAM Offset */
#define TRAM_RAM686_REG_OFST           _UINT32_(0x1AB8)    /* (TRAM_RAM686) TrustRAM Offset */
#define TRAM_RAM687_REG_OFST           _UINT32_(0x1ABC)    /* (TRAM_RAM687) TrustRAM Offset */
#define TRAM_RAM688_REG_OFST           _UINT32_(0x1AC0)    /* (TRAM_RAM688) TrustRAM Offset */
#define TRAM_RAM689_REG_OFST           _UINT32_(0x1AC4)    /* (TRAM_RAM689) TrustRAM Offset */
#define TRAM_RAM690_REG_OFST           _UINT32_(0x1AC8)    /* (TRAM_RAM690) TrustRAM Offset */
#define TRAM_RAM691_REG_OFST           _UINT32_(0x1ACC)    /* (TRAM_RAM691) TrustRAM Offset */
#define TRAM_RAM692_REG_OFST           _UINT32_(0x1AD0)    /* (TRAM_RAM692) TrustRAM Offset */
#define TRAM_RAM693_REG_OFST           _UINT32_(0x1AD4)    /* (TRAM_RAM693) TrustRAM Offset */
#define TRAM_RAM694_REG_OFST           _UINT32_(0x1AD8)    /* (TRAM_RAM694) TrustRAM Offset */
#define TRAM_RAM695_REG_OFST           _UINT32_(0x1ADC)    /* (TRAM_RAM695) TrustRAM Offset */
#define TRAM_RAM696_REG_OFST           _UINT32_(0x1AE0)    /* (TRAM_RAM696) TrustRAM Offset */
#define TRAM_RAM697_REG_OFST           _UINT32_(0x1AE4)    /* (TRAM_RAM697) TrustRAM Offset */
#define TRAM_RAM698_REG_OFST           _UINT32_(0x1AE8)    /* (TRAM_RAM698) TrustRAM Offset */
#define TRAM_RAM699_REG_OFST           _UINT32_(0x1AEC)    /* (TRAM_RAM699) TrustRAM Offset */
#define TRAM_RAM700_REG_OFST           _UINT32_(0x1AF0)    /* (TRAM_RAM700) TrustRAM Offset */
#define TRAM_RAM701_REG_OFST           _UINT32_(0x1AF4)    /* (TRAM_RAM701) TrustRAM Offset */
#define TRAM_RAM702_REG_OFST           _UINT32_(0x1AF8)    /* (TRAM_RAM702) TrustRAM Offset */
#define TRAM_RAM703_REG_OFST           _UINT32_(0x1AFC)    /* (TRAM_RAM703) TrustRAM Offset */
#define TRAM_RAM704_REG_OFST           _UINT32_(0x1B00)    /* (TRAM_RAM704) TrustRAM Offset */
#define TRAM_RAM705_REG_OFST           _UINT32_(0x1B04)    /* (TRAM_RAM705) TrustRAM Offset */
#define TRAM_RAM706_REG_OFST           _UINT32_(0x1B08)    /* (TRAM_RAM706) TrustRAM Offset */
#define TRAM_RAM707_REG_OFST           _UINT32_(0x1B0C)    /* (TRAM_RAM707) TrustRAM Offset */
#define TRAM_RAM708_REG_OFST           _UINT32_(0x1B10)    /* (TRAM_RAM708) TrustRAM Offset */
#define TRAM_RAM709_REG_OFST           _UINT32_(0x1B14)    /* (TRAM_RAM709) TrustRAM Offset */
#define TRAM_RAM710_REG_OFST           _UINT32_(0x1B18)    /* (TRAM_RAM710) TrustRAM Offset */
#define TRAM_RAM711_REG_OFST           _UINT32_(0x1B1C)    /* (TRAM_RAM711) TrustRAM Offset */
#define TRAM_RAM712_REG_OFST           _UINT32_(0x1B20)    /* (TRAM_RAM712) TrustRAM Offset */
#define TRAM_RAM713_REG_OFST           _UINT32_(0x1B24)    /* (TRAM_RAM713) TrustRAM Offset */
#define TRAM_RAM714_REG_OFST           _UINT32_(0x1B28)    /* (TRAM_RAM714) TrustRAM Offset */
#define TRAM_RAM715_REG_OFST           _UINT32_(0x1B2C)    /* (TRAM_RAM715) TrustRAM Offset */
#define TRAM_RAM716_REG_OFST           _UINT32_(0x1B30)    /* (TRAM_RAM716) TrustRAM Offset */
#define TRAM_RAM717_REG_OFST           _UINT32_(0x1B34)    /* (TRAM_RAM717) TrustRAM Offset */
#define TRAM_RAM718_REG_OFST           _UINT32_(0x1B38)    /* (TRAM_RAM718) TrustRAM Offset */
#define TRAM_RAM719_REG_OFST           _UINT32_(0x1B3C)    /* (TRAM_RAM719) TrustRAM Offset */
#define TRAM_RAM720_REG_OFST           _UINT32_(0x1B40)    /* (TRAM_RAM720) TrustRAM Offset */
#define TRAM_RAM721_REG_OFST           _UINT32_(0x1B44)    /* (TRAM_RAM721) TrustRAM Offset */
#define TRAM_RAM722_REG_OFST           _UINT32_(0x1B48)    /* (TRAM_RAM722) TrustRAM Offset */
#define TRAM_RAM723_REG_OFST           _UINT32_(0x1B4C)    /* (TRAM_RAM723) TrustRAM Offset */
#define TRAM_RAM724_REG_OFST           _UINT32_(0x1B50)    /* (TRAM_RAM724) TrustRAM Offset */
#define TRAM_RAM725_REG_OFST           _UINT32_(0x1B54)    /* (TRAM_RAM725) TrustRAM Offset */
#define TRAM_RAM726_REG_OFST           _UINT32_(0x1B58)    /* (TRAM_RAM726) TrustRAM Offset */
#define TRAM_RAM727_REG_OFST           _UINT32_(0x1B5C)    /* (TRAM_RAM727) TrustRAM Offset */
#define TRAM_RAM728_REG_OFST           _UINT32_(0x1B60)    /* (TRAM_RAM728) TrustRAM Offset */
#define TRAM_RAM729_REG_OFST           _UINT32_(0x1B64)    /* (TRAM_RAM729) TrustRAM Offset */
#define TRAM_RAM730_REG_OFST           _UINT32_(0x1B68)    /* (TRAM_RAM730) TrustRAM Offset */
#define TRAM_RAM731_REG_OFST           _UINT32_(0x1B6C)    /* (TRAM_RAM731) TrustRAM Offset */
#define TRAM_RAM732_REG_OFST           _UINT32_(0x1B70)    /* (TRAM_RAM732) TrustRAM Offset */
#define TRAM_RAM733_REG_OFST           _UINT32_(0x1B74)    /* (TRAM_RAM733) TrustRAM Offset */
#define TRAM_RAM734_REG_OFST           _UINT32_(0x1B78)    /* (TRAM_RAM734) TrustRAM Offset */
#define TRAM_RAM735_REG_OFST           _UINT32_(0x1B7C)    /* (TRAM_RAM735) TrustRAM Offset */
#define TRAM_RAM736_REG_OFST           _UINT32_(0x1B80)    /* (TRAM_RAM736) TrustRAM Offset */
#define TRAM_RAM737_REG_OFST           _UINT32_(0x1B84)    /* (TRAM_RAM737) TrustRAM Offset */
#define TRAM_RAM738_REG_OFST           _UINT32_(0x1B88)    /* (TRAM_RAM738) TrustRAM Offset */
